#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 `success`
<details><summary>Validation Output</summary>

```

[32m[1mSuccess![0m The configuration is valid.
[0m

```

</details>

#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform

[0m[1mdata.aws_vpc.selected: Reading...[0m[0m
[0m[1mdata.aws_ami.ubuntu: Reading...[0m[0m
[0m[1mdata.aws_ami.ubuntu: Read complete after 0s [id=ami-0e783882a19958fff][0m
[0m[1mdata.aws_vpc.selected: Read complete after 2s [id=vpc-04adbc006871eed44][0m
[0m[1maws_security_group.shared_web: Refreshing state... [id=sg-0eaa09a266a7750e4][0m
[0m[1maws_instance.shared_web: Refreshing state... [id=i-06f3dc39e2156218c][0m
[0m[1maws_eip.shared_web: Refreshing state... [id=eipalloc-05ac0c945fbec8074][0m
[0m
[1m[36mNote:[0m[1m Objects have changed outside of Terraform[0m

[0mTerraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

[1m  # aws_instance.shared_web[0m has changed[0m[0m
[0m  [33m~[0m[0m resource "aws_instance" "shared_web" {
        [1m[0mid[0m[0m                                   = "i-06f3dc39e2156218c"
      [33m~[0m [0m[1m[0mpublic_dns[0m[0m                           = "ec2-54-81-10-102.compute-1.amazonaws.com" [33m->[0m [0m"ec2-44-216-25-66.compute-1.amazonaws.com"
        [1m[0mtags[0m[0m                                 = {
            "Application"        = "shared.web"
            "Environment"        = "prod"
            "ManagedByTerraform" = "True"
            "Name"               = "shared.web-prod-shared-web"
        }
        [90m# (32 unchanged attributes hidden)[0m[0m

        [90m# (8 unchanged blocks hidden)[0m[0m
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [33m~[0m update in-place
[31m-[0m/[32m+[0m destroy and then create replacement
[0m
Terraform will perform the following actions:

[1m  # aws_instance.shared_web[0m will be updated in-place[0m[0m
[0m  [33m~[0m[0m resource "aws_instance" "shared_web" {
        [1m[0mid[0m[0m                                   = "i-06f3dc39e2156218c"
      [33m~[0m [0m[1m[0mtags[0m[0m                                 = {
          [33m~[0m [0m"Name"               = "shared.web-prod-shared-web" [33m->[0m [0m"shared.web-prod-webserver"
            [90m# (3 unchanged elements hidden)[0m[0m
        }
      [33m~[0m [0m[1m[0mtags_all[0m[0m                             = {
          [33m~[0m [0m"Name"               = "shared.web-prod-shared-web" [33m->[0m [0m"shared.web-prod-webserver"
            [90m# (3 unchanged elements hidden)[0m[0m
        }
      [33m~[0m [0m[1m[0muser_data[0m[0m                            = "57475533ae78964e4f4f962dc8e1afa067fd2dd7" [33m->[0m [0m"240566a8b1ed4bc2ed7a554dadc02b320b77d4b4"
      [33m~[0m [0m[1m[0mvpc_security_group_ids[0m[0m               = [
          [31m-[0m [0m"sg-0eaa09a266a7750e4",
        ] [33m->[0m [0m(known after apply)
        [90m# (30 unchanged attributes hidden)[0m[0m

        [90m# (8 unchanged blocks hidden)[0m[0m
    }

[1m  # aws_security_group.shared_web[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_security_group" "shared_web" {
      [33m~[0m [0m[1m[0marn[0m[0m                    = "arn:aws:ec2:us-east-1:294287152212:security-group/sg-0eaa09a266a7750e4" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mid[0m[0m                     = "sg-0eaa09a266a7750e4" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mname[0m[0m                   = "shared.web-prod-shared-web" [33m->[0m [0m"shared.web-prod-internet-access" [31m# forces replacement[0m[0m
      [32m+[0m [0m[1m[0mname_prefix[0m[0m            = (known after apply)
      [33m~[0m [0m[1m[0mowner_id[0m[0m               = "294287152212" [33m->[0m [0m(known after apply)
      [31m-[0m [0m[1m[0mtags[0m[0m                   = {} [90m->[0m [0m[90mnull[0m[0m
      [33m~[0m [0m[1m[0mtags_all[0m[0m               = {} [33m->[0m [0m(known after apply)
        [90m# (5 unchanged attributes hidden)[0m[0m
    }

[0m[1mPlan:[0m 1 to add, 1 to change, 1 to destroy.
[0m[0m
[1mChanges to Outputs:[0m[0m
  [33m~[0m [0m[1m[0maws_instance_public_dns[0m[0m = "ec2-54-81-10-102.compute-1.amazonaws.com" [33m->[0m [0m"ec2-44-216-25-66.compute-1.amazonaws.com"
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>